lib/metova/dummy/app/controllers/api/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 584139033]]
---
    def index
      user = User.find params[:user_id]